dvucinozd/Pajoniiir/firmware/control-board-s3/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Pajoniiir product default: the S3 USB OTG peripheral hosts the Pioneer
# DDJ-FLX4 and translates supported MIDI controls to the P4 control link.
CONFIG_DDJ_FLX4_TRANSLATE_TO_P4=y

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# RTOS – 1 kHz tick for 1 ms resolution in debounce timers
CONFIG_FREERTOS_HZ=1000

# Console on UART0 (GPIO43 TX, GPIO44 RX). USB-OTG (GPIO19/20) is fully owned
# by the USB host; USB-Serial/JTAG (primary or secondary) conflicts with it
# and prevents USB enumeration.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Increase control transfer size to support large configuration descriptors of DDJ-FLX4
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=512

# Seeed Studio XIAO ESP32S3 migration wiring. The previous DevKitC wiring used
# GPIO40/GPIO41 and the abandoned SuperMini candidate used GPIO12/GPIO13; the
# XIAO exposes neither pair on its header.
CONFIG_CONTROL_LINK_UART_TX_GPIO=5
CONFIG_CONTROL_LINK_UART_RX_GPIO=6

# ── FLX4 USB headphones audio — product default (merged 2026-07-10) ───────────
# Was the separate sdkconfig.flx4_hp_e2e overlay; folded in so a plain
# `idf.py build` produces the sound firmware. Real P4 hp_out monitor mix ->
# I2S link (BCLK7/WS8/DIN9) -> ring -> FLX4 USB Audio phones.
CONFIG_DDJ_FLX4_USB_AUDIO_HEADPHONES=y
CONFIG_DDJ_FLX4_USB_AUDIO_RING_AUTOSTART=y
CONFIG_P4_AUDIO_LINK_ENABLED=y
CONFIG_P4_AUDIO_LINK_BCLK_GPIO=7
CONFIG_P4_AUDIO_LINK_WS_GPIO=8
CONFIG_P4_AUDIO_LINK_DIN_GPIO=9
# FLX4 playback is an isochronous OUT endpoint; bias the USB host FIFO to
# periodic OUT so the host can claim it.
# CONFIG_USB_HOST_HW_BUFFER_BIAS_BALANCED is not set
# CONFIG_USB_HOST_HW_BUFFER_BIAS_IN is not set
CONFIG_USB_HOST_HW_BUFFER_BIAS_PERIODIC_OUT=y
